Amritach/FreeRTOS-Examples-on-LPC1768-/RTOS_04/uart.c
/***************************************************************************************************
                                   ExploreEmbedded	
****************************************************************************************************
 * File:   uart.c (ARM controllers)
 * Version: 15.0
 * Author: ExploreEmbedded
 * Website: http://www.exploreembedded.com/wiki
 * Description: File contains the Library routines for UART

The libraries have been tested on ExploreEmbedded development boards. We strongly believe that the 
library works on any of development boards for respective controllers. However, ExploreEmbedded 
disclaims any kind of hardware failure resulting out of usage of libraries, directly or indirectly.
Files may be subject to change without prior notice. The revision history contains the information 
related to updates. 


GNU GENERAL PUBLIC LICENSE: 
    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <http://www.gnu.org/licenses/>. 

Errors and omissions should be reported to codelibraries@exploreembedded.com
 **************************************************************************************************/


/**************************************************************************************************
                             Revision History
****************************************************************************************************
15.0: Initial version 
***************************************************************************************************/
#include <LPC17xx.h>
#include <stdarg.h>
#include "uart.h"
#include "stdutils.h"



static uint32_t uart_GetPclk(void);



/***************************************************************************************************
                         void UART_Init(uint32_t var_baudRate_u32)
****************************************************************************************************
 * I/P Arguments: uint32_t : Baudrate to be configured.
 * Return value	: none

 * description  :This function is used to initialize the UART at specified baud rate.
                 If the requested baud rate is not within the supported range then
                 the default baud rate of 9600 is set.


		    Refer uart.h file for Supported(range) baud rates.		
***************************************************************************************************/
void UART_Init(uint32_t var_baudRate_u32)
{
	
	LPC_PINCON->PINSEL0 &= ~0x000000F0;
	LPC_PINCON->PINSEL0 |= 0x00000050;			// Enable TxD0 P0.2 and p0.3 
	
    LPC_UART0->FCR = M_UartFifoControl_U32;		// Enable FIFO and reset Rx/Tx FIFO buffers	
	LPC_UART0->LCR = M_UartLineControl_U32;	    // 8bit data, 1Stop bit, No parity
	
	UART_SetBaudRate(var_baudRate_u32);
	
	util_BitClear(LPC_UART0->LCR,(M_DlabBitPosition_U8)); // Clear DLAB after setting DLL,DLM
		
}






/***************************************************************************************************
                         void UART_SetBaudRate(uint32_t var_baudRate_u32)
 ***************************************************************************************************
 * I/P Arguments: uint32_t : var_baudRate_u32 to be configured.
 * Return value	: none

 * description  :This function is used to Set/Change the baudrate on the fly.
                 If the requested baud rate is not within the supported range then
                 the default baudrate of 9600 is set.

		    Refer uart.h file for Supported range of baud rates.
***************************************************************************************************/
void UART_SetBaudRate(uint32_t var_baudRate_u32)
{
	uint32_t var_RegValue_u32, var_Pclk_u32;

	
	var_Pclk_u32 = uart_GetPclk();
		
   	if((var_baudRate_u32 >= C_MinBaudRate_U32) && (var_baudRate_u32<=C_MaxBaudRate_U32))
	{
		/* Check if the requested baudrate is within range,
	     If yes then calculate the value to be loaded into baud rate generator. */
		var_RegValue_u32 = M_GetBaudRateGeneratorValue(var_Pclk_u32,var_baudRate_u32);
	}
	else
	{
		/*	 Invalid baudrate requested, hence set it to default baudrate of 9600 */
		var_RegValue_u32 = M_GetBaudRateGeneratorValue(var_Pclk_u32,9600);
	}
		
	LPC_UART0->DLL = util_ExtractByte0to8(var_RegValue_u32);
	LPC_UART0->DLM = util_ExtractByte8to16(var_RegValue_u32);
	
}






/***************************************************************************************************
							void uart_GetPclk(uint32_t var_Pclk_u32)
 ***************************************************************************************************
 * I/P Arguments: uint32_t : var_Pclk_u32 
 * Return value	: var_Pclk_u32 in terms of system frequency

 * description  :This function is used to calculate pclock in terms of system frequency.

***************************************************************************************************/

static uint32_t uart_GetPclk(void)
{
    uint32_t var_UartPclk_u32,var_Pclk_u32;
	/** 
	   PCLKSELx registers contains the PCLK info for all the clock dependent peripherals.
	   Bit6,Bit7 contains the Uart Clock(ie.UART_PCLK) information.
	   The UART_PCLK and the actual Peripheral Clock(PCLK) is calculated as below.
	   (Refer data sheet for more info)
	   
	   UART_PCLK    PCLK
	     0x00       SystemFreq/4        
		 0x01       SystemFreq
		 0x02       SystemFreq/2
		 0x03       SystemFreq/8   
	 **/

	var_UartPclk_u32 = (LPC_SC->PCLKSEL0 >> 6) & 0x03;

